In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('income (3).csv')
df

        Name  Monthly_Income
0        Rob            5000
1      Rafiq            6000
2       Nina            4000
3      Sofia            7500
4      Mohan            8000
5        Tao            7000
6  Elon Musk        10000000

In [3]:
df.describe()

       Monthly_Income
count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07

In [4]:
df.Monthly_Income.quantile(.75)

7750.0

In [5]:
df.Monthly_Income.quantile(0.25, interpolation='lower')

5000

In [6]:
df.Monthly_Income.quantile(0.25, interpolation='higher')

6000

In [7]:
df.Monthly_Income.quantile(0.25, interpolation='midpoint')

5500.0

In [8]:
df.Monthly_Income.quantile(0.25, interpolation='linear')

5500.0

In [9]:
df.Monthly_Income.quantile(.90)

4004800.0000000037

In [10]:
df = df[df.Monthly_Income < df.Monthly_Income.quantile(.90)]

In [11]:
df

    Name  Monthly_Income
0    Rob            5000
1  Rafiq            6000
2   Nina            4000
3  Sofia            7500
4  Mohan            8000
5    Tao            7000

In [12]:
import numpy as np

In [13]:
df.loc[3]

Name              Sofia
Monthly_Income     7500
Name: 3, dtype: object

In [14]:
df.iloc[3]

Name              Sofia
Monthly_Income     7500
Name: 3, dtype: object

In [15]:
df.loc[3]['Monthly_Income']

7500

In [16]:
df

    Name  Monthly_Income
0    Rob            5000
1  Rafiq            6000
2   Nina            4000
3  Sofia            7500
4  Mohan            8000
5    Tao            7000

In [17]:
df['Monthly_Income'][3] = np.nan

C:\Users\User\AppData\Local\Temp/ipykernel_7656/1794197083.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Monthly_Income'][3] = np.nan
C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [18]:
df

    Name  Monthly_Income
0    Rob          5000.0
1  Rafiq          6000.0
2   Nina          4000.0
3  Sofia             NaN
4  Mohan          8000.0
5    Tao          7000.0

In [19]:
df.Monthly_Income.fillna(df.Monthly_Income.median(), inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:6392: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

In [20]:
df

    Name  Monthly_Income
0    Rob          5000.0
1  Rafiq          6000.0
2   Nina          4000.0
3  Sofia          6000.0
4  Mohan          8000.0
5    Tao          7000.0

In [21]:
df.describe()

       Monthly_Income
count        6.000000
mean      6000.000000
std       1414.213562
min       4000.000000
25%       5250.000000
50%       6000.000000
75%       6750.000000
max       8000.000000

In [23]:
df = pd.read_csv('AB_NYC_2019.csv')
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [24]:
df.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,4.889500e+04,4.889500e+04,48895.000000,48895.000000,48895.000000,48895.000000,48895.000000,38843.000000,48895.000000,48895.000000
mean,1.901714e+07,6.762001e+07,40.728949,-73.952170,152.720687,7.029962,23.274466,1.373221,7.143982,112.781327
std,1.098311e+07,7.861097e+07,0.054530,0.046157,240.154170,20.510550,44.550582,1.680442,32.952519,131.622289
min,2.539000e+03,2.438000e+03,40.499790,-74.244420,0.000000,1.000000,0.000000,0.010000,1.000000,0.000000
25%,9.471945e+06,7.822033e+06,40.690100,-73.983070,69.000000,1.000000,1.000000,0.190000,1.000000,0.000000
50%,1.967728e+07,3.079382e+07,40.723070,-73.955680,106.000000,3.000000,5.000000,0.720000,1.000000,45.000000
75%,2.915218e+07,1.074344e+08,40.763115,-73.936275,175.000000,5.000000,24.000000,2.020000,2.000000,227.000000
max,3.648724e+07,2.743213e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000